In [1]:
import numpy as np
import pandas as pd

In [ ]:
A normal DataFrame

In [4]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
    'Age': [24, 27, 22, 32, 29, 24],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'New York'],
    'Salary': [70000, 80000, 65000, 120000, 95000, 68000],
    'Experience': [2, 5, 1, 10, 7, 2]
}
# Convert dictionary to DataFrame
df = pd.DataFrame(data)

In [ ]:
Using multi-indexing (hierarchical indexing)

In [5]:
df.set_index(['City', 'Name'], inplace=True)
print("DataFrame with MultiIndex:\n", df)

DataFrame with MultiIndex:
                      Age  Salary  Experience
City        Name
New York    Alice     24   70000           2
Los Angeles Bob       27   80000           5
Chicago     Charlie   22   65000           1
Houston     David     32  120000          10
Phoenix     Eve       29   95000           7
New York    Frank     24   68000           2

In [ ]:
Resetting multi-index to default integer index

In [6]:
df.reset_index(inplace=True)
print("\nDataFrame after resetting MultiIndex:\n", df)

DataFrame after resetting MultiIndex:
           City     Name  Age  Salary  Experience
0     New York    Alice   24   70000           2
1  Los Angeles      Bob   27   80000           5
2      Chicago  Charlie   22   65000           1
3      Houston    David   32  120000          10
4      Phoenix      Eve   29   95000           7
5     New York    Frank   24   68000           2

In [ ]:
Using the query function to query the DataFrame

In [7]:
result = df.query('Age > 25 and Salary > 70000')
print("\nQuery result where Age > 25 and Salary > 70000:\n", result)

Query result where Age > 25 and Salary > 70000:
           City   Name  Age  Salary  Experience
1  Los Angeles    Bob   27   80000           5
3      Houston  David   32  120000          10
4      Phoenix    Eve   29   95000           7

In [ ]:
Using the eval function for evaluating expressions

In [8]:
df['Salary After Tax'] = df.eval('Salary * 0.7')
print("\nDataFrame after evaluating Salary After Tax:\n", df)

DataFrame after evaluating Salary After Tax:
           City     Name  Age  Salary  Experience  Salary After Tax
0     New York    Alice   24   70000           2           49000.0
1  Los Angeles      Bob   27   80000           5           56000.0
2      Chicago  Charlie   22   65000           1           45500.0
3      Houston    David   32  120000          10           84000.0
4      Phoenix      Eve   29   95000           7           66500.0
5     New York    Frank   24   68000           2           47600.0

In [ ]:
Time series data


Creating data

In [9]:
dates = pd.date_range('20210101', periods=6)

In [ ]:
Creating a DataFrame with time series index

In [10]:
time_series_df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
print("\nTime series DataFrame:\n", time_series_df)

Time series DataFrame:
                    A         B         C         D
2021-01-01  0.561334 -0.195253 -1.266928 -0.033401
2021-01-02  0.068284 -0.132949 -1.161447  0.557771
2021-01-03  1.431604  0.054423 -0.483531  0.767823
2021-01-04  1.687224 -1.087964  0.158288 -1.017157
2021-01-05 -0.322554  2.577319  0.608581  0.305277
2021-01-06  0.421156  0.634915 -0.847765  1.298522

In [ ]:
Resampling time series data

In [11]:
resampled_df = time_series_df.resample('M').mean()
print("\nResampled DataFrame (monthly mean):\n", resampled_df)

Resampled DataFrame (monthly mean):
                    A         B       C         D
2021-01-31  0.641175  0.308415 -0.4988  0.313139

C:\Users\KARTHIKA RAJAGOPAL\AppData\Local\Temp\ipykernel_3364\4138361594.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  resampled_df = time_series_df.resample('M').mean()

In [ ]:
Using rolling window calculations

In [12]:
rolling_mean = time_series_df.rolling(window=3).mean()
print("\nRolling mean (window=3) of time series DataFrame:\n", rolling_mean)

Rolling mean (window=3) of time series DataFrame:
                    A         B         C         D
2021-01-01       NaN       NaN       NaN       NaN
2021-01-02       NaN       NaN       NaN       NaN
2021-01-03  0.687074 -0.091260 -0.970635  0.430731
2021-01-04  1.062371 -0.388830 -0.495563  0.102812
2021-01-05  0.932091  0.514592  0.094446  0.018648
2021-01-06  0.595275  0.708090 -0.026965  0.195547

In [ ]:
Using expanding window calculations

In [13]:
expanding_sum = time_series_df.expanding(min_periods=1).sum()
print("\nExpanding sum of time series DataFrame:\n", expanding_sum)

Expanding sum of time series DataFrame:
                    A         B         C         D
2021-01-01  0.561334 -0.195253 -1.266928 -0.033401
2021-01-02  0.629617 -0.328202 -2.428375  0.524370
2021-01-03  2.061222 -0.273780 -2.911906  1.292194
2021-01-04  3.748446 -1.361744 -2.753617  0.275037
2021-01-05  3.425892  1.215575 -2.145037  0.580314
2021-01-06  3.847047  1.850490 -2.992801  1.878835

In [ ]:
Using the apply function with complex functions

In [14]:
def complex_function(x):
    return x.max() - x.min()

complex_result = df[['Age', 'Salary']].apply(complex_function, axis=0)
print("\nResult of applying complex function (max - min) to Age and Salary columns:\n", complex_result)

Result of applying complex function (max - min) to Age and Salary columns:
 Age          10
Salary    55000
dtype: int64

In [ ]:
Using the transform function for element-wise transformations

In [15]:
df['Normalized Salary'] = df.groupby('City')['Salary'].transform(lambda x: (x - x.mean()) / x.std())
print("\nDataFrame after normalizing Salary within each City group:\n", df)

DataFrame after normalizing Salary within each City group:
           City     Name  Age  Salary  Experience  Salary After Tax  \
0     New York    Alice   24   70000           2           49000.0
1  Los Angeles      Bob   27   80000           5           56000.0
2      Chicago  Charlie   22   65000           1           45500.0
3      Houston    David   32  120000          10           84000.0
4      Phoenix      Eve   29   95000           7           66500.0
5     New York    Frank   24   68000           2           47600.0

   Normalized Salary
0           0.707107
1                NaN
2                NaN
3                NaN
4                NaN
5          -0.707107

In [ ]:
Using the aggregate function for multiple aggregations

In [16]:
agg_result = df.groupby('City').agg({
    'Age': ['mean', 'min', 'max'],
    'Salary': ['sum', 'mean', 'count']
})
print("\nAggregate result of Age and Salary by City:\n", agg_result)

Aggregate result of Age and Salary by City:
               Age          Salary
             mean min max     sum      mean count
City
Chicago      22.0  22  22   65000   65000.0     1
Houston      32.0  32  32  120000  120000.0     1
Los Angeles  27.0  27  27   80000   80000.0     1
New York     24.0  24  24  138000   69000.0     2
Phoenix      29.0  29  29   95000   95000.0     1

In [ ]:
Using pivot_table with multiple aggregation functions

In [17]:
pivot_table = df.pivot_table(values='Salary', index='City', columns='Experience', aggfunc=[np.mean, np.sum])
print("\nPivot table with multiple aggregation functions:\n", pivot_table)

Pivot table with multiple aggregation functions:
                 mean                                           sum            \
Experience        1        2        5        7         10       1         2
City
Chicago      65000.0      NaN      NaN      NaN       NaN  65000.0       NaN
Houston          NaN      NaN      NaN      NaN  120000.0      NaN       NaN
Los Angeles      NaN      NaN  80000.0      NaN       NaN      NaN       NaN
New York         NaN  69000.0      NaN      NaN       NaN      NaN  138000.0
Phoenix          NaN      NaN      NaN  95000.0       NaN      NaN       NaN


Experience        5        7         10
City
Chicago          NaN      NaN       NaN
Houston          NaN      NaN  120000.0
Los Angeles  80000.0      NaN       NaN
New York         NaN      NaN       NaN
Phoenix          NaN  95000.0       NaN

C:\Users\KARTHIKA RAJAGOPAL\AppData\Local\Temp\ipykernel_3364\651698548.py:1: FutureWarning: The provided callable <function mean at 0x0000027A891CEA20> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pivot_table = df.pivot_table(values='Salary', index='City', columns='Experience', aggfunc=[np.mean, np.sum])
C:\Users\KARTHIKA RAJAGOPAL\AppData\Local\Temp\ipykernel_3364\651698548.py:1: FutureWarning: The provided callable <function sum at 0x0000027A891CD940> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  pivot_table = df.pivot_table(values='Salary', index='City', columns='Experience', aggfunc=[np.mean, np.sum])

In [ ]:
Merging dataframes

In [ ]:
df_left = df[['Name', 'Age']]
df_right = df[['Name', 'Salary']]

In [ ]:
Inner join

In [18]:
inner_merged_df = pd.merge(df_left, df_right, on='Name', how='inner')
print("\nInner joined DataFrame:\n", inner_merged_df)

NameError: name 'df_left' is not defined

In [ ]:
Outer join

In [19]:
outer_merged_df = pd.merge(df_left, df_right, on='Name', how='outer')
print("\nOuter joined DataFrame:\n", outer_merged_df)

NameError: name 'df_left' is not defined

In [ ]:
Using the merge_asof function for ordered merges

In [20]:
df_stock = pd.DataFrame({
    'Date': pd.date_range('20210101', periods=6),
    'Stock_Price': [100, 102, 105, 107, 110, 115]
})
df_event = pd.DataFrame({
    'Date': pd.date_range('20210102', periods=3, freq='2D'),
    'Event': ['Event1', 'Event2', 'Event3']
})

In [21]:
asof_merged_df = pd.merge_asof(df_stock, df_event, on='Date')
print("\nAs-of merged DataFrame:\n", asof_merged_df)

As-of merged DataFrame:
         Date  Stock_Price   Event
0 2021-01-01          100     NaN
1 2021-01-02          102  Event1
2 2021-01-03          105  Event1
3 2021-01-04          107  Event2
4 2021-01-05          110  Event2
5 2021-01-06          115  Event3

In [ ]:
Using the crosstab function for cross-tabulation

In [22]:
crosstab_result = pd.crosstab(df['City'], df['Experience'])
print("\nCrosstab result of City and Experience:\n", crosstab_result)

Crosstab result of City and Experience:
 Experience   1   2   5   7   10
City
Chicago       1   0   0   0   0
Houston       0   0   0   0   1
Los Angeles   0   0   1   0   0
New York      0   2   0   0   0
Phoenix       0   0   0   1   0

In [ ]:
Using the explode function to transform lists into rows

In [23]:
df_with_list = df.copy()
df_with_list['Skills'] = [['Python', 'R'], ['Java'], ['Python', 'Java', 'R'], [], ['Python'], ['Java', 'C++']]
exploded_df = df_with_list.explode('Skills')
print("\nDataFrame after exploding Skills column:\n", exploded_df)

DataFrame after exploding Skills column:
           City     Name  Age  Salary  Experience  Salary After Tax  \
0     New York    Alice   24   70000           2           49000.0
0     New York    Alice   24   70000           2           49000.0
1  Los Angeles      Bob   27   80000           5           56000.0
2      Chicago  Charlie   22   65000           1           45500.0
2      Chicago  Charlie   22   65000           1           45500.0
2      Chicago  Charlie   22   65000           1           45500.0
3      Houston    David   32  120000          10           84000.0
4      Phoenix      Eve   29   95000           7           66500.0
5     New York    Frank   24   68000           2           47600.0
5     New York    Frank   24   68000           2           47600.0

   Normalized Salary  Skills
0           0.707107  Python
0           0.707107       R
1                NaN    Java
2                NaN  Python
2                NaN    Java
2                NaN       R
3                NaN     NaN
4                NaN  Python
5          -0.707107    Java
5          -0.707107     C++

In [ ]:
Styling DataFrames

In [24]:
def highlight_max(s):
    is_max = s == s.max()
    return ['background-color: yellow' if v else '' for v in is_max]

In [25]:
styled_df = df.style.apply(highlight_max, subset=['Age', 'Salary'])
print("\nStyled DataFrame:\n", styled_df)

Styled DataFrame:
 <pandas.io.formats.style.Styler object at 0x0000027A8A5C7710>

In [ ]:
Using the pipe function to apply multiple functions sequentially

In [27]:
def add_experience(df):
    df['Experience'] = df['Experience'] + 1
    return df

def increase_salary(df):
    df['Salary'] = df['Salary'] * 1.05
    return df

piped_df = df.pipe(add_experience).pipe(increase_salary)
print("\nDataFrame after applying multiple functions sequentially with pipe:\n", piped_df)

DataFrame after applying multiple functions sequentially with pipe:
           City     Name  Age    Salary  Experience  Salary After Tax  \
0     New York    Alice   24   73500.0           3           49000.0
1  Los Angeles      Bob   27   84000.0           6           56000.0
2      Chicago  Charlie   22   68250.0           2           45500.0
3      Houston    David   32  126000.0          11           84000.0
4      Phoenix      Eve   29   99750.0           8           66500.0
5     New York    Frank   24   71400.0           3           47600.0

   Normalized Salary
0           0.707107
1                NaN
2                NaN
3                NaN
4                NaN
5          -0.707107